[Strings]
app_title=YaToML
col_key=Key
col_type=Type
col_value=Value
column_label=Column
document_label=Document
err_cannot_open_file=Could not open the file.
err_cannot_open_for_write=Could not open the file for writing.
err_display_internal=Internal error while displaying the file:
err_display_unknown=Unknown internal error while displaying the file.
err_incomplete_write=The file could not be written completely.
err_save_aborted_verification=Save aborted: safety check failed. The file was NOT changed.
err_unexpected_internal=Unexpected internal error: 
err_unknown_parse=Unknown internal error while parsing.
kind_alias=Alias
kind_bool=Bool
kind_datetime=DateTime
kind_float=Float
kind_integer=Integer
kind_list=List
kind_map=Map
kind_null=Null
kind_string=String
line_label=Line
menu_collapse_all=Collapse all
menu_copy_key=Copy key
menu_copy_value=Copy value
menu_edit_value=Edit	F2
menu_expand_all=Expand all
menu_navigate=Jump to tree node
menu_save=Save	Ctrl+S
msg_parse_error_cannot_save=This file has a parse error and cannot be saved.
msg_saved_with_hints=Saved, but with notes:
parse_error_label=Parse error
preview_alias_prefix=[Alias -> 
preview_list=[List]
preview_map=[Map]
save_failed_suffix=Save failed
status_unsaved=Unsaved changes
verify_structure_child_count=Structural mismatch after patching (child count).
verify_structure_doc_count=Structural mismatch after patching (document count).
verify_structure_node_type=Structural mismatch after patching (node type).
verify_unexpected_change=A non-edited value changed unexpectedly.
verify_value_mismatch=A saved value does not match the expected new value.
warn_block_scalar=A multi-line block value (|/>) was NOT saved (not yet supported for this case).
warn_could_not_locate=A changed value could not be safely located and was NOT saved.
warn_flow_container=A value inside a flow structure ([...]/{...}) was NOT saved (not yet supported for this case).
warn_internal_position_error=Internal position error on a changed value -- NOT saved.
warn_invalid_datetime_prefix=Invalid date value '
warn_invalid_datetime_suffix=' was NOT saved (original value kept).
warn_no_position=A changed value without a known position was NOT saved.
warn_unexpected_value=An unexpected value was NOT saved (original value kept).
warn_verify_failed_prefix=Safety check failed (
warn_verify_failed_suffix=) -- NOTHING was saved.
warn_verify_nothing_saved=NOTHING was saved.
warn_verify_original_unparsable=original is not re-parsable
warn_verify_unparsable=Safety check failed (result is no longer parsable) -- 
